[
  {
    "title":"Printer broken",
    "id":"1",
    "issuePreview":"Something is wrong with my printer",
    "issue":"Adipiscing parturient arcu ac venenatis id consectetur metus et ullamcorper id viverra facilisi a eget felis.Elementum montes.",
    "solution":"Mus ut porttitor vestibulum erat eu imperdiet vestibulum conubia parturient eros pharetra nisi scelerisque nisl pulvinar lacus a a fermentum netus a maecenas facilisi a egestas adipiscing a elit. Placerat ad ultricies felis hac suspendisse quisque non a cum ad sociis curabitur condimentum ad parturient cras at vehicula hendrerit sem ac nisl dictumst aenean vulputate vestibulum et. Volutpat nisl a nisi parturient ullamcorper a parturient mus ligula a fringilla aptent elit habitant eu consequat ad mi natoque.\nVestibulum dis elementum penatibus ultricies ac adipiscing at semper ac suspendisse fames in lacinia netus dolor vivamus pretium scelerisque. Convallis faucibus fames aptent natoque adipiscing diam ac parturient hac rhoncus accumsan lacus in vestibulum. Vestibulum libero quis penatibus tellus hendrerit sociis gravida ad pretium sociosqu consectetur lobortis convallis vestibulum scelerisque. Scelerisque mus a nisi placerat condimentum eu condimentum nascetur facilisis adipiscing cras a proin ullamcorper dis curabitur vel ante eros elementum adipiscing at. Interdum ante lacinia vivamus natoque eu a ut ligula facilisi consectetur suspendisse sem parturient ullamcorper netus hac adipiscing leo ad a. Nec sociis rhoncus per ac ullamcorper erat eleifend eu cursus per quisque metus interdum ultrices est habitant.\nLeo aptent elementum natoque sed adipiscing parturient et est mi blandit malesuada fames consectetur curabitur fames facilisi in. Ante parturient dolor suspendisse quis vestibulum a facilisi nam varius semper at a faucibus velit scelerisque vestibulum scelerisque nam sem torquent tristique ipsum pretium. Adipiscing posuere metus ultrices ut metus suspendisse turpis gravida elit a feugiat a dictumst at adipiscing etiam vestibulum a cum lobortis ut. A donec posuere mauris cras eu a nam suspendisse fermentum nisi nam a ullamcorper egestas arcu adipiscing vivamus. Dictum leo a ad a suspendisse ridiculus sodales et dui a fames a parturient a luctus nam condimentum risus id curabitur dictumst fermentum egestas adipiscing mi a ullamcorper accumsan. Nisl taciti consectetur magna montes consectetur cum odio at rutrum a ad venenatis rutrum est id cum condimentum a ante in.",
    "checkedOut":"false"
  },
  {
    "title":"Internet broken",
    "id":"2",
    "issuePreview":"Can't connect to the internet",
    "issue":"Nulla cum dictum consectetur mi potenti mollis elit torquent lectus consequat ante massa cursus tristique convallis vestibulum eu eros nulla a mi euismod magna auctor mattis tristique scelerisque vehicula. Scelerisque vestibulum imperdiet vehicula sodales nascetur cum adipiscing sapien ut blandit dolor adipiscing parturient dapibus nisi quam nibh porta etiam ligula eget felis eros diam vestibulum. Convallis fermentum ante a quis himenaeos diam sociosqu a facilisi parturient vestibulum eu ad donec a ullamcorper dis vel condimentum. A eget at ad inceptos a dui scelerisque mus ut a urna amet vel dui integer. At dictumst a parturient facilisi scelerisque at nisi urna at per curabitur dignissim a metus.\n Ultricies a ante donec a venenatis habitasse vehicula eros imperdiet tempus adipiscing dapibus commodo integer ullamcorper consectetur ut mauris consectetur diam scelerisque magna a aliquam primis tempor iaculis. Sodales enim vestibulum a ullamcorper mi eget suspendisse a torquent vestibulum etiam vel massa phasellus leo curae nec duis mauris scelerisque eu nam eu accumsan.",
    "solution":"Dui inceptos vel vehicula eleifend viverra ullamcorper dignissim adipiscing at parturient quisque parturient nisi varius dictumst vestibulum fringilla in volutpat. Leo dui nunc est a dictum himenaeos senectus scelerisque a parturient elit ad hac cursus cubilia mi rutrum a a mi urna auctor parturient curabitur in curabitur. A suspendisse condimentum est eu suscipit suspendisse accumsan platea fames odio a mauris ridiculus ornare nisi sociis velit. Ridiculus in ut id conubia a convallis pharetra eget a suspendisse est litora suspendisse curabitur ad quam vestibulum condimentum eros cum fames sociosqu tempus nisi turpis. Ipsum molestie a parturient per scelerisque ullamcorper vestibulum hendrerit turpis at dis inceptos dignissim ante massa eros nostra a consectetur a a vestibulum id gravida parturient dolor fringilla a.\n Libero rhoncus dolor etiam aenean penatibus a auctor nec nisi ac nisl ultricies lacus a. Id a consectetur pulvinar pharetra nisi vestibulum metus elit eleifend at turpis adipiscing facilisis nec ridiculus scelerisque a scelerisque torquent habitant facilisis curae erat. Suscipit ad consectetur nibh pulvinar pharetra commodo tincidunt commodo nulla blandit suspendisse leo vitae sem vestibulum elit. Adipiscing sem porta hac tortor tristique pulvinar eu scelerisque mollis imperdiet scelerisque bibendum luctus id urna interdum ante condimentum a nostra ullamcorper a parturient lacus. Ante vestibulum risus turpis viverra rutrum ante parturient pulvinar nibh vivamus sem class morbi habitant vulputate vehicula condimentum malesuada sapien id non sagittis adipiscing a a commodo. Suscipit eros adipiscing dapibus scelerisque aptent dui nascetur eu habitant eu velit proin egestas posuere pretium integer suscipit condimentum interdum orci adipiscing lobortis a donec at.\nFusce per adipiscing habitasse velit a platea nunc suspendisse quis adipiscing a vestibulum id a parturient a scelerisque bibendum sodales lacinia elit. Suspendisse aliquet sociis orci facilisis molestie justo mi metus vestibulum parturient suspendisse tempus convallis per iaculis sed ad. A ultricies ac sagittis et a luctus a integer et sodales purus morbi lacus pharetra a augue eu parturient class parturient placerat eu eros taciti. Consectetur porta laoreet neque mauris pretium ullamcorper volutpat a et aenean mauris risus tempus sed vel a sit parturient condimentum parturient penatibus potenti cum a a. Scelerisque at et parturient sit parturient dui facilisis sit in cum volutpat tempor cubilia hac senectus adipiscing a nibh condimentum per hac a nisi nostra. \n Vehicula interdum magna cum nunc id a scelerisque et dolor duis euismod ac nec gravida scelerisque magnis consequat aenean morbi ad parturient facilisi pulvinar netus netus tellus ridiculus. Eget egestas erat nunc ornare mi dictum a curabitur malesuada diam curabitur egestas magna a urna. Euismod quisque nibh tempus ad consectetur condimentum dictumst eu condimentum a curabitur proin potenti feugiat duis a dignissim praesent suspendisse elementum mi lacus. \n Adipiscing senectus ligula dictumst duis interdum vestibulum leo placerat ullamcorper ultricies parturient rhoncus commodo nisl aliquam convallis magna quam ullamcorper scelerisque a porta in. Nisi eu nostra hendrerit commodo suspendisse potenti interdum a class odio dui a hac tempor parturient justo dui sed dolor at adipiscing diam mattis parturient. Tempor ullamcorper primis condimentum adipiscing ut dictumst phasellus ullamcorper a scelerisque fringilla ante vitae suspendisse. Hac at parturient a interdum vestibulum ligula purus a proin at quis orci neque mus feugiat fringilla a a ut. Ullamcorper luctus condimentum tincidunt gravida eleifend consectetur scelerisque parturient a ridiculus a a a scelerisque class a magnis quisque vel dignissim interdum elit euismod dolor. \n A quam vitae scelerisque diam at orci sem consectetur adipiscing at vestibulum tortor parturient a. Ut parturient ac montes aliquam ante a primis faucibus mus sit ligula vivamus pulvinar justo et cum ut. At orci in a a arcu cum elementum sociis ullamcorper a per odio commodo nam non. Euismod integer enim semper himenaeos scelerisque magna elementum aptent a habitant vivamus justo parturient nisi nulla facilisis lorem cum in dis per amet sagittis inceptos vel. \n Luctus a elit rutrum ac scelerisque vestibulum ipsum neque duis semper pulvinar lacus proin duis aliquet mi adipiscing. A commodo convallis nisl inceptos himenaeos magnis parturient gravida parturient praesent sit montes nostra ac mauris arcu a. In mi fermentum suspendisse vestibulum a interdum conubia justo nec ac curabitur aptent a et fringilla est dui nisi ut placerat condimentum.",
    "checkedOut":"false"
  },
  {
    "title":"Computer broken",
    "id":"3",
    "issuePreview":"Something is wrong with my computer",
    "issue":"A mollis hendrerit fringilla eros fermentum aliquam justo ac bibendum parturient a volutpat fringilla fusce cum ligula habitant a facilisis habitant magna vestibulum cubilia vestibulum arcu faucibus. In a in dapibus amet praesent eros torquent a dui ac at vestibulum adipiscing aliquet nullam parturient arcu dolor dis. Mi leo a dapibus vitae parturient a vitae in habitant ac scelerisque magnis phasellus a. Suspendisse platea dignissim ullamcorper neque morbi eu sociosqu condimentum scelerisque integer orci accumsan commodo parturient. Ullamcorper class at arcu eu ullamcorper facilisi at mollis proin sociis mollis ligula mi consectetur erat id montes a ac a at vestibulum quam eget bibendum urna faucibus. \n Parturient feugiat ac volutpat at ridiculus suspendisse potenti praesent egestas ut potenti posuere a condimentum laoreet pretium suscipit et penatibus habitasse venenatis dui senectus parturient elit adipiscing vitae. Nisi sit ac velit dis odio semper vestibulum a commodo est odio facilisi senectus eleifend scelerisque parturient id condimentum parturient ullamcorper dictumst pharetra porttitor hendrerit sociis ante vel. Convallis scelerisque placerat ullamcorper sem penatibus adipiscing malesuada dui curabitur phasellus sem rhoncus ante purus dis adipiscing aenean ultricies ullamcorper per a condimentum. Vestibulum orci conubia a sagittis etiam a commodo dictum est orci scelerisque torquent amet senectus augue proin vulputate etiam augue habitant et parturient suspendisse venenatis facilisi scelerisque eu tincidunt. Diam a potenti tincidunt phasellus sem risus fusce congue diam a est fames parturient quam ultricies potenti a mi mi tempus rutrum malesuada mi ullamcorper nunc ridiculus scelerisque. Ipsum torquent adipiscing per fames fermentum maecenas a ipsum parturient hendrerit est erat rutrum accumsan dui ut a consectetur dictumst mattis felis duis donec purus montes adipiscing.",
    "solution":"Nam mi enim gravida imperdiet vestibulum parturient torquent cum lectus cursus elit nibh vulputate nunc et ultricies velit elementum ac dui aptent scelerisque. A velit adipiscing a elit condimentum a mi ullamcorper urna duis nunc ut urna condimentum venenatis. Sem eu quis scelerisque taciti aliquam mollis vivamus tortor curae eleifend potenti a a torquent orci enim viverra. A adipiscing integer a est eu a a himenaeos adipiscing cursus id a parturient faucibus elit et at nam potenti arcu adipiscing a. \n Morbi a consectetur eros nibh a rhoncus erat a aliquet natoque libero duis quisque integer adipiscing a parturient condimentum ipsum ante adipiscing a consectetur tristique morbi. Porta pretium a amet potenti commodo a nunc molestie consectetur maecenas at venenatis condimentum parturient adipiscing tempor ac sodales. A parturient eu parturient conubia montes erat semper fusce vitae a id sit adipiscing a ad eros orci vestibulum mi sed habitant habitasse nam ipsum malesuada semper nostra velit. Urna non ac a dapibus conubia sociosqu ad turpis a felis malesuada parturient et enim. Accumsan auctor non mi a sit aptent lectus justo sapien gravida dictum parturient condimentum eu quis suspendisse. \n A parturient ultrices a sodales ac vestibulum dapibus dis a a tellus id scelerisque eget nascetur condimentum dapibus. Orci suscipit vulputate consectetur ullamcorper est potenti dapibus curabitur volutpat blandit faucibus ac rutrum conubia lacus condimentum sed morbi aenean purus libero cum per scelerisque adipiscing. Rutrum parturient sociis sociis a suspendisse fames primis dictumst ut sapien curae posuere tincidunt ullamcorper a a massa nisl. Ut parturient nunc adipiscing mi vivamus phasellus at montes placerat eu nostra phasellus maecenas a a nibh eget tristique.",
    "checkedOut":"true"
  }
]
