[{"id":"ceb081c6-254a-4d69-9a11-a02a75a24198","checkedOut":false,"archived":false,"viewCount":59,"relatedProducts":["phone"],"relatedTickets":["3000a","2000a","3000a","3000a","4000a","6000a"],"issuePreview":"incididunt duis do reprehenderit magna laboris fugiat cillum consectetur elit incididunt est ea labore irure culpa ullamco culpa voluptate Lorem","issue":"Cillum nostrud sunt deserunt aliquip anim nisi laboris sunt excepteur id. Cupidatat mollit duis officia minim adipisicing mollit esse pariatur minim aute aliqua dolor. Amet pariatur aliquip velit consequat esse fugiat dolore anim ut aliqua quis nulla. In pariatur labore aute velit culpa laborum eu. Est culpa ipsum exercitation eiusmod ipsum.\r\nLaboris ea ex non et. Voluptate voluptate amet duis consectetur aute. Do sunt consequat aute deserunt. Adipisicing pariatur culpa voluptate irure. Commodo fugiat laborum sint labore cillum exercitation do enim in mollit. Sit ad do dolore et anim qui quis nostrud eu reprehenderit laboris velit irure ullamco. Exercitation incididunt amet voluptate voluptate.\r\nConsectetur elit reprehenderit consequat tempor amet sit enim incididunt. Officia excepteur non magna adipisicing aliqua mollit deserunt deserunt nostrud labore pariatur fugiat proident dolore. Id non amet aliqua ex exercitation mollit. Cupidatat Lorem sit adipisicing sit est enim ea dolore consectetur officia adipisicing quis deserunt.\r\nEu elit officia quis proident cupidatat consequat Lorem nostrud excepteur. Dolor aliquip nisi laboris incididunt aliqua officia excepteur id aliquip duis eiusmod. Incididunt labore consequat cupidatat commodo aute minim magna laboris pariatur excepteur. Sunt reprehenderit sit deserunt laboris aliquip fugiat quis laboris.\r\n","solution":"Occaecat qui do non voluptate commodo aute cupidatat cillum enim ut voluptate sit eu Lorem. Nisi proident proident commodo eiusmod officia sit ad incididunt. Nostrud tempor cupidatat elit ea ipsum ut nisi pariatur.\r\nVoluptate adipisicing aute exercitation nulla proident cillum eiusmod nisi est laboris fugiat magna ea. Est cupidatat labore non veniam velit sint irure consequat enim ullamco. Reprehenderit do duis eiusmod nostrud anim esse ea. Ex esse culpa ad esse ullamco mollit officia consectetur aliqua. Nostrud esse reprehenderit elit ad pariatur adipisicing et in.\r\nNulla Lorem sunt do eu officia aute ipsum aliqua voluptate aliquip. Esse ex culpa labore officia sunt eu cillum officia. Id do veniam culpa laborum aliqua dolore fugiat eiusmod sunt velit. Esse aute ex non anim nulla magna reprehenderit duis eu eu nulla ea excepteur.\r\nDeserunt pariatur sit nulla nostrud occaecat. Laboris irure velit dolor magna id ut qui et veniam. Non reprehenderit tempor quis eu ullamco commodo minim cupidatat officia. Velit ipsum anim sint aliquip anim. Adipisicing in tempor elit veniam eiusmod ex in pariatur Lorem esse aute commodo.\r\nIrure consequat sit ullamco anim qui ullamco occaecat do aute anim et excepteur consequat aliqua. In elit proident adipisicing duis tempor commodo commodo. Est eiusmod minim ex dolore nostrud exercitation sunt laborum. In voluptate amet voluptate in eiusmod cillum reprehenderit tempor ipsum quis dolor.\r\n","authorId":1007,"title":"nisi amet irure exercitation et occaecat ullamco sunt ad sunt","datesEdited":[["2014-03-01T07:22:54","1003a"]],"dateSubmitted":"2014-10-30T03:57:33 +07:00","dateLastViewed":"2015-09-14T07:06:12 +07:00"}]
